#+TITLE: towerdoom
#+AUTHOR: Frederic Boileau
#+email:frederic.boileau@protonmail.com
#+PROPERTY: ATTACH_DIR .
#+ATTR_ORG: :width 200/250/300/400/500/600
#+TODO: always(a) fixme(r) next(n) todo(t) inprog(p) stable(d) idea(i) project(j) wait(w) | broken(b)

* temp hack
#+BEGIN_SRC emacs-lisp
(load "/home/gaston/macs/packages/org-wiki.el")
#+END_SRC

* idea irc
:PROPERTIES:
:header-args: :tangle no
:END:
#+BEGIN_SRC emacs-lisp
#+END_SRC

#+RESULTS:
| chat.freenode.net | :tls | t | :nick | ouestbillie | :sasl-username | ouestbillie | :sasl-password | /i!R"[*2x;%s | :port | 6667 | :channels | (#emacs-circe) |

* todo future
** always packages
*** memacs
- https://github.com/novoid/Memacs
*** zoom
  https://github.com/cyrus-and/zoom
*** org fs tree
https://emacs.stackexchange.com/questions/35274/how-to-import-directory-structure-to-org-mode-heading
*** org preview html
- https://github.com/lujun9972/org-preview-html
*** calctex
https://github.com/johnbcoughlin/calctex

*** org-mind-map
- https://github.com/theodorewiles/org-mind-map

*** org helm rifle

*** drag stuff
https://github.com/rejeep/drag-stuff.el

*** org-protocol-capture-html
https://github.com/alphapapa/org-protocol-capture-html

*** deft
https://jblevins.org/projects/deft/

*** imdb
https://www.goodreads.com/book/show/3450744-nudge

https://www.reddit.com/r/emacs/comments/9n0d0p/wikipedia_info_org_wikinforg/
** always links
https://orgmode.org/worg/org-tutorials/#org4320b02
https://sachachua.com/blog/
https://www.gnu.org/software/emacs/manual/html_mono/eintr.html
https://cestlaz.github.io/stories/emacs/

** next stabilize org-fs-tree
#+begin_src emacs-lisp
(require 'org-fs-tree)
#+end_src

#+RESULTS:
: org-fs-tree

** idea avy
** idea complete snippets

** idea printing
:PROPERTIES:
:header-args: :tangle yes
:END:
#+begin_src elisp
(require 'printing)		; load printing package
(setq pr-path-alist
	    '((unix      "." "/bin" ghostview mpage PATH)
	      (ghostview "/usr/bin/gsview")
	      (mpage     "/usr/bin/mpage")))
(setq pr-ps-name       'lps)
(setq pr-ps-printer-alist '((lpss "lp" nil "-d" "HLL2390DW")))
(pr-update-menus t)
#+end_src

** project [#C] email
** project [#B] setup web
- https://www.emacswiki.org/emacs/emacs-w3m

** project [#B] better attachment integration
- org download
- org protocol
- org attach
- org wiki assets

** project [#B] show properties as tags
-


** test

* stable ui
** general
:PROPERTIES:
:header-args: :tangle yes
:END:
#+BEGIN_SRC emacs-lisp
(set-default-font "Iosevka Nerd Font 12")
(set-face-attribute 'default nil :family "Iosevka Nerd Font" :height 130)
(set-face-attribute 'fixed-pitch nil :family "Iosevka Nerd Font")
(set-face-attribute 'variable-pitch nil :family "EtBembo")


(add-hook 'prog-mode-hook 'rainbow-delimiters-mode)
(set-frame-parameter (selected-frame) 'alpha '(87 . 87))
(setq mouse-wheel-scroll-amount '(1 ((shift) . 1))) ;; one line at a time
(setq mouse-wheel-progressive-speed nil) ;; don't accelerate scrolling
(setq mouse-wheel-follow-mouse 't) ;; scroll window under mouse

(setq-default tab-width 2)
(setq c-basic-indent 2)
(setq artist-aspect-ratio 2.0)

(global-set-key (kbd "C-x C-b") 'ibuffer)
(autoload 'ibuffer "ibuffer" "List buffers." t)
(use-package doom-themes)
;; (load "~/temp/dotfiles/emacsy/packages/my-doom-themes-ext-org.el")

(require 'doom-themes)
(setq doom-themes-enable-bold t
      doom-themes-enable-italic t)
(doom-themes-org-config)

(defun disable-all-themes ()
  "disable all active themes."
  (dolist (i custom-enabled-themes)
    (disable-theme i)))
(defadvice load-theme (before disable-themes-first activate)
  (disable-all-themes))
(load-theme 'doom-nord)
#+END_SRC

** modeline
#+BEGIN_SRC emacs-lisp
(use-package doom-modeline
      :ensure t
      :hook (after-init . doom-modeline-mode))
(doom-modeline 1)
(setq doom-modeline-major-mode-icon t)
#+END_SRC
** org ui
:PROPERTIES:
:header-args: :tangle yes
:END:
#+BEGIN_SRC emacs-lisp
(setq org-hide-emphasis-markers t)
(font-lock-add-keywords 'org-mode
                        '(("^ *\\([-]\\) "
                           (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))
(use-package org-bullets
  :config
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))

(let* ((variable-tuple
        (cond
         ((x-family-fonts "Iosevka") '(:family "Nerd Font Complete"))
         ((x-family-fonts "Hack")    '(:family "Nerd Font Complete"))
         (nil (warn "Cannot find font"))))
       (base-font-color     (face-foreground 'default nil 'default))
       (headline           `(:inherit default :weight bold :foreground ,base-font-color)))

  (custom-theme-set-faces
   'user
   `(org-level-8 ((t (,@headline ,@variable-tuple))))
   `(org-level-7 ((t (,@headline ,@variable-tuple))))
   `(org-level-6 ((t (,@headline ,@variable-tuple))))
   `(org-level-5 ((t (,@headline ,@variable-tuple))))
   `(org-level-4 ((t (,@headline ,@variable-tuple :height 1.1))))
   `(org-level-3 ((t (,@headline ,@variable-tuple :height 1.25))))
   `(org-level-2 ((t (,@headline ,@variable-tuple :height 1.5))))
   `(org-level-1 ((t (,@headline ,@variable-tuple :height 1.75))))
   `(org-document-title ((t (,@headline ,@variable-tuple :height 2.0 :underline nil))))))

(custom-theme-set-faces
 'user
 '(variable-pitch ((t (:family "Nerd Font Complete" :height 180 :weight light))))
 '(fixed-pitch ((t ( :family "Inconsolata" :slant normal :weight normal :height 1.0 :width normal)))))
(add-hook 'org-mode-hook 'variable-pitch-mode)
#+END_SRC

#+RESULTS:
| variable-pitch-mode | (lambda nil (org-bullets-mode 1)) | er/add-org-mode-expansions | org-clock-load | org-tempo-setup | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | doom-disable-show-paren-mode-h | doom-disable-show-trailing-whitespace-h | +org-enable-auto-reformat-tables-h | +org-enable-auto-update-cookies-h | +org-unfold-to-2nd-level-or-point-h | evil-org-mode | org-fancy-priorities-mode | org-bullets-mode | toc-org-enable | +evil-embrace-latex-mode-hook-h | embrace-org-mode-hook | org-eldoc-load |

* stable basic
:PROPERTIES:
:header-args: :tangle yes
:END:
:LOGBOOK:
CLOCK: [2019-09-18 Wed 01:55]--[2019-09-18 Wed 01:55] =>  0:00
- test
:END:
** stable COMMENT basic basic
:PROPERTIES:
:header-args: :tangle yes
:END:
#+BEGIN_SRC elisp
(require 'org-alert)
(setq alert-default-style 'libnotify)
(setq evil-want-C-u-scroll nil
      evil-want-C-d-scroll nil)
(setq browse-url-browser-function 'browse-url-generic
      browse-url-generic-program "firefox")
;; Files association
(setq org-file-apps
      '((auto-mode . emacs)
        ("\\.djvu\\" . "evince \"%s\"")
        ("\\.pdf\\" . "evince \"%s\"")
        ("\\.docx\\" . "libreoffice \"%s")))
#+END_SRC
** inprog spelling
http://manuel-uberti.github.io/emacs/2016/06/06/spellchecksetup/
#+BEGIN_SRC emacs-lisp
(setq ispell-program-name (executable-find "hunspell")
      ispell-dictionary "en_US")
(bind-key "C-c I"
          (lambda ()
            (interactive)
            (ispell-change-dictionary "fr_CA")
            (flyspell-buffer)))

(bind-key "C-c E"
          (lambda ()
            (interactive)
            (ispell-change-dictionary "en_GB")
            (flyspell-buffer)))

#+END_SRC

#+RESULTS:
| lambda | nil | (interactive) | (ispell-change-dictionary en_GB) | (flyspell-buffer) |

** stable bib stuff
*** new default files
#+BEGIN_SRC emacs-lisp
(setq reftex-default-bibliography '("~/academic/biblio/master-bib.bib"))

(setq org-ref-bibliography-notes "~/academic/biblio/orgRefNotes.org"
      org-ref-default-bibliography '("~/academic/biblio/master-bib.bib")
      org-ref-pdf-directory "~/academic/biblio/papers/")

(setq bibtex-completion-bibliography '("~/academic/biblio/master-bib.bib")
      bibtex-completion-library-path "~/academic/biblio/papers/"
      bibtex-completion-notes-path "~/academic/biblio/helm-bibtex-notes")

(setq bibtex-completion-pdf-field "file")
(setq bibtex-completion-pdf-open-function
      (lambda (fpath)
        (start-process "evince" "*helm-bibtex-evince*" "/usr/bin/evince"
                       fpath)))

(setq bibtex-dialect 'biblatex)
#+END_SRC

#+RESULTS:
: biblatex

*** stable completion format
:PROPERTIES:
:header-args: :tangle yes
:END:
#+BEGIN_SRC elisp
(setq bibtex-completion-format-citation-functions
      '((org-mode . bibtex-completion-format-citation-ebib)
        (latex-mode    . bibtex-completion-format-citation-cite)
        (markdown-mode . bibtex-completion-format-citation-pandoc-citeproc)
        (default       . bibtex-completion-format-citation-default)))
#+END_SRC

#+RESULTS:
: ((org-mode . bibtex-completion-format-citation-ebib) (latex-mode . bibtex-completion-format-citation-cite) (markdown-mode . bibtex-completion-format-citation-pandoc-citeproc) (default . bibtex-completion-format-citation-default))

*** idea completion display format
#+begin_src elisp
(setq bibtex-completion-display-formats
      '((article       . "${author:36} ${title:*} ${journal:40} ${year:4} ${=has-pdf=:1}${=has-note=:1} ${=type=:3}")
        (inbook        . "${author:36} ${title:*} Chapter ${chapter:32} ${year:4} ${=has-pdf=:1}${=has-note=:1} ${=type=:3}")
        (incollection  . "${author:36} ${title:*} ${booktitle:40} ${year:4} ${=has-pdf=:1}${=has-note=:1} ${=type=:3}")
        (inproceedings . "${author:36} ${title:*} ${booktitle:40} ${year:4} ${=has-pdf=:1}${=has-note=:1} ${=type=:3}")
        (t             . "${author:36} ${title:*} ${year:4} ${=has-pdf=:1}${=has-note=:1} ${=type=:3}")))
#+end_src

#+RESULTS:
: ((article . ${author:36} ${title:*} ${journal:40} ${year:4} ${=has-pdf=:1}${=has-note=:1} ${=type=:3}) (inbook . ${author:36} ${title:*} Chapter ${chapter:32} ${year:4} ${=has-pdf=:1}${=has-note=:1} ${=type=:3}) (incollection . ${author:36} ${title:*} ${booktitle:40} ${year:4} ${=has-pdf=:1}${=has-note=:1} ${=type=:3}) (inproceedings . ${author:36} ${title:*} ${booktitle:40} ${year:4} ${=has-pdf=:1}${=has-note=:1} ${=type=:3}) (t . ${author:36} ${title:*} ${year:4} ${=has-pdf=:1}${=has-note=:1} ${=type=:3}))

** fixme basic bindings
#+BEGIN_SRC elisp
(bind-key (kbd "M-y") 'helm-show-kill-ring)
(bind-key (kbd "M-o") 'company-complete)

(bind-key (kbd "M-p") nil)
(bind-key (kbd "M-p l") 'org-cliplink)
(bind-key (kbd "M-p v") 'org-brain-visualize)
(bind-key (kbd "M-p a") '+popup/raise)
(bind-key (kbd "M-p c") 'org-id-get-create)
(bind-key (kbd "M-p r") 'slime-repl)
#+END_SRC

#+RESULTS:
: slime-repl

** stable searching
*** swiper/ivy :melpa:github:
:PROPERTIES:
:GH:       https://github.com/abo-abo/swiper
:END:

**** small config example from github
#+begin_src elisp :tangle yes :results replace
(ivy-mode 1)
(setq ivy-use-virtual-buffers t)
(setq enable-recursive-minibuffers t)
;; enable this if you want `swiper' to use it
;; (setq search-default-mode #'char-fold-to-regexp)
(global-set-key "\C-s" 'swiper)
(global-set-key (kbd "C-c C-r") 'ivy-resume)
(global-set-key (kbd "<f6>") 'ivy-resume)
(global-set-key (kbd "C-x C-f") 'counsel-find-file)
(global-set-key (kbd "<f1> f") 'counsel-describe-function)
(global-set-key (kbd "<f1> v") 'counsel-describe-variable)
(global-set-key (kbd "<f1> l") 'counsel-find-library)
(global-set-key (kbd "<f2> i") 'counsel-info-lookup-symbol)
(global-set-key (kbd "<f2> u") 'counsel-unicode-char)
(global-set-key (kbd "C-c g") 'counsel-git)
(global-set-key (kbd "C-c f") 'counsel-fzf)
(global-set-key (kbd "C-c j") 'counsel-git-grep)
(global-set-key (kbd "C-c k") 'counsel-ag)
(global-set-key (kbd "C-x l") 'counsel-locate)
#+end_src

#+RESULTS:
: counsel-locate

- http://develop.spacemacs.org/layers/+completion/ivy/README.html

*** rg
:PROPERTIES:
:GH:       https://github.com/dajva/rg.el
:header-args: :tangle yes
:END:
#+BEGIN_SRC elisp
(use-package rg
  :bind (("C-c l" . 'counsel-rg)
         ("C-c r" . 'counsel-projectile-rg))
  :config
  (rg-enable-default-bindings))
#+END_SRC

#+RESULTS:
: counsel-rg

** stable tempo
som text
#+BEGIN_SRC elisp
(require 'org-tempo)
(setq tempo-interactive t)
(tempo-define-template "my-property"
                       '(":PROPERTIES:" p ":END:" >)
                       "<p"
                       "Insert a property tempate")
(tempo-define-template "name"
                       '("#+NAME:" (p "Name : " name)  >)
                       "<n"
                       "Insert name")
(tempo-define-template "attr-org"
                       '("#+ATTR_ORG: :width 400")
                       "<o")
#+END_SRC
some text
** stable evil
:PROPERTIES:
:header-args: :tangle yes
:END:
some text
#+BEGIN_SRC elisp
(run-with-idle-timer 20 t 'evil-normal-state)

(setq-default
 evil-escape-key-sequence "jk"
 evil-escape-unordered-key-sequence "true")

(evil-define-key nil evil-insert-state-map
  "\C-f" 'evil-forward-char
  "\C-b" 'evil-backward-char
  "\C-k" 'kill-line
  "\C-y" 'evil-paste-after)
#+END_SRC

#+RESULTS:

some text
** stable defengines
:PROPERTIES:
:header-args: :tangle yes
:END:
#+begin_src elisp
(require 'engine-mode)
(engine-mode t)

(defengine wolfram-alpha
  "http://www.wolframalpha.com/input/?i=%s")

(defengine libgen-articles
  "http://gen.lib.rus.ec/scimag/?q=%s")

(defengine libgen-books
  "http://gen.lib.rus.ec/search.php?req=%s")

(defengine wiktionary
  "https://www.wikipedia.org/search-redirect.php?family=wiktionary&language=en&go=Go&search=%s"
  :keybinding "p")

(defengine youtube
  "http://www.youtube.com/results?aq=f&oq=&search_query=%s"
  :keybinding "y")

(defengine goodreads
  "https://www.goodreads.com/search?q=%s"
  :keybinding "r")

(defengine wikipedia
  "http://www.wikipedia.org/search-redirect.php?language=en&go=Go&search=%s"
  :keybinding "w"
  :docstring "Searchin' the wikis.")

(defengine stack-overflow
  "https://stackoverflow.com/search?q=%s"
  :keybinding "s")

(defengine amazon
  "http://www.amazon.com/s/ref=nb_sb_noss?url=search-alias%3Daps&field-keywords=%s"
  :keybinding "a")

(defengine duckduckgo
  "https://duckduckgo.com/?q=%s"
  :keybinding "d")

(defengine google
  "http://www.google.com/search?ie=utf-8&oe=utf-8&q=%s"
  :keybinding "g")

(defengine github
  "https://github.com/search?ref=simplesearch&q=%s"
  :keybinding "h")

(defengine google-maps
  "http://maps.google.com/maps?q=%s"
  :docstring "Mappin' it up."
  :keybinding "m")

(defengine project-gutenberg
  "http://www.gutenberg.org/ebooks/search/?query=%s")

(defengine rfcs
  "http://pretty-rfc.herokuapp.com/search?q=%s")

(defengine twitter
  "https://twitter.com/search?q=%s")




#+end_src

#+RESULTS:
: engine/search-twitter

* stable org
** always links
https://tasshin.com/blog/implementing-a-second-brain-in-empty-keys-and-org-mode/
https://lepisma.xyz
** stable basic set keys and variables
:PROPERTIES:
:header-args: :tangle yes
:END:
#+NAME:org-basic-set-keys
#+BEGIN_SRC emacs-lisp
(setq org-directory "~/.personal/org")
(setq org-agenda-files '("~/.personal/org"))
(setq org-modules '(org-wikinodes org-w3m org-bbdb org-bibtex
                                  org-docview org-gnus org-info org-irc org-mhe org-rmail org-eww))

(setq org-attach-dir-relative t)
(setq org-refile-targets '((nil :maxlevel . 9)
                           (org-agenda-files :maxlevel . 9)))

(setq org-outline-path-complete-in-steps nil)         ; Refile in a single go
(setq org-refile-use-outline-path t)                  ;

(setq org-babel-lisp-eval-fn 'sly-eval)
(setq org-cycle-separator-lines 2)


(if (require 'toc-org nil t)
    (add-hook 'org-mode-hook 'toc-org-mode)
  (warn "toc-org not found"))

(setq org-blank-before-new-entry '((heading . auto) (plain-list-item . auto)))

(global-set-key (kbd "C-c l") 'org-store-link)
(global-set-key (kbd "C-c a") 'org-agenda)
(global-set-key (kbd "C-c c") 'org-capture)

(setq org-latex-pdf-process
      (list "latexmk -pdflatex='lualatex -shell-escape -interaction nonstopmode' -pdf -f %f"))

#+END_SRC

#+RESULTS: org-basic-set-keys
| latexmk -pdflatex='lualatex -shell-escape -interaction nonstopmode' -pdf -f %f |

** fixme ui
mostly from https://lepisma.xyz/2017/10/28/ricing-org-mode/index.html
#+begin_src emacs-lisp
(setq org-pretty-entities t
      org-hide-emphasis-markers t
      org-fontify-whole-heading-line t
      org-fontify-quote-and-verse-blocks t)
#+end_src

#+RESULTS:
: t

** stable package one liner(ish) inits
#+begin_src elisp
(setq org-books-file "~/.personal/org/master-book-list.org")
(require 'org-attach)
(setq org-link-abbrev-alist '(("file" . org-attach-expand-link)))
(use-package org-contacts
  :after org
  :custom (org-contacts-files '("~/.personal/org/contacts.org")))
(use-package org-download :after org)
(use-package org-protocol-capture-html :after org)
#+end_src

#+RESULTS:
: org-protocol-capture-html

** stable properties
:PROPERTIES:
:header-args: :tangle yes
:END:
#+begin_src elisp
(setq org-clock-persist 'history)
(org-clock-persistence-insinuate)
;; Log the time when a TODO item was finished
(setq org-log-done 'time)

;; Specify global tags with fast tag selection
(setq org-tag-alist '((:startgroup . nil) ("@school" . ?o) ("@home" . ?h) (:endgroup . nil)
                      ("computer" . ?c) ("reading" . ?r) ("udem" . ?u) ("!udem" . ?!) ("!aux" . ?a)
                      ("grocery" . ?g) ("homework" . ?w) ("research" . ?r)))

;; Effort and global properties
(setq org-global-properties '(("Effort_ALL". "0 0:10 0:20 0:30 1:00 1:30 2:00 3:00 4:00 6:00 8:00")))

;; Set global Column View format
(setq org-columns-default-format '"%38ITEM(Details) %TAGS(Context) %7TODO(To Do) %5Effort(Time){:} %6CLOCKSUM(Clock)")
#+end_src

#+RESULTS:
: %38ITEM(Details) %TAGS(Context) %7TODO(To Do) %5Effort(Time){:} %6CLOCKSUM(Clock)

** stable small utilities
#+begin_src elisp
(defun org-archive-done-tasks ()
  (interactive)
  (org-map-entries
   (lambda ()
     (org-archive-subtree)
     (setq org-map-continue-from (outline-previous-heading)))
   "/DONE" 'tree))

(defun custom-org-cliplink ()
  (interactive)
  (org-cliplink-insert-transformed-title
   (org-cliplink-clipboard-content)     ;take the URL from the CLIPBOARD
   (lambda (url title)
     (let* ((parsed-url (url-generic-parse-url url)) ;parse the url
            (clean-title
             (cond
              ;; if the host is github.com, cleanup the title
              ((string= (url-host parsed-url) "github.com")
               (replace-regexp-in-string "GitHub - .*: \\(.*\\)" "\\1" title))
              ;; otherwise keep the original title
              (t title))))
       ;; forward the title to the default org-cliplink transformer
       (org-cliplink-org-mode-link-transformer url clean-title)))))
#+end_src

#+RESULTS:
: custom-org-cliplink

** stable evil
:PROPERTIES:
:header-args: :tangle yes
:END:

#+BEGIN_SRC emacs-lisp
(use-package evil-org
  :commands evil-org-mode
  :after org
  :init
  (add-hook 'org-mode-hook 'evil-org-mode)
  :config

  (evil-define-key 'normal evil-org-mode-map
    "<" 'org-metaleft
    ">" 'org-metaright
    "-" 'org-cycle-list-bullet
    (kbd "TAB") 'org-cycle)
  ;; normal & insert state shortcuts.
  (mapc (lambda (state)
          (evil-define-key state evil-org-mode-map
            (kbd "C-;") 'ober-eval-block-in-repl
            (kbd "M-;") 'ober-eval-in-repl
            (kbd "M-l") 'org-metaright
            (kbd "M-h") 'org-metaleft
            (kbd "M-k") 'org-metaup
            (kbd "M-j") 'org-metadown
            (kbd "M-L") 'org-shiftmetaright
            (kbd "M-H") 'org-shiftmetaleft
            (kbd "M-K") 'org-shiftmetaup
            (kbd "M-J") 'org-shiftmetadown))
        '('normal 'insert)))
#+END_SRC

#+RESULTS:
: t

** stable capture                                                  :tocheck:
:PROPERTIES:
:header-args: :tangle yes
:url:      http://howardism.org/Technical/Emacs/capturing-content.html
:END:

#+srcname: capture-templates
#+BEGIN_SRC elisp
(setq org-default-notes-file (concat org-directory "notes.org"))
(setq org-capture-templates
      '(("t" "Todo" entry (file+headline "~/.personal/org/inbox.org" "tasks")
         "* todo %?\n:PROPERTIES:\n:Created: %U\n:Linked: %A\n:END:\n %i"
         :prepend t)

        ("s" "Started" entry (file+headline "~/.personal/org/inbox.org" "tasks")
         "* started %?\n %i" :clock-in t :clock-keep t :prepend t)

        ("j" "Journal" entry (file+olp+datetree "~/.personal/org/journal.org")
         "* %?\nEntered on %U\n %i\n %a")

        ("b" "Books" entry (file+headline "~/notes/books.org" "Books")
         "* %(read-string \"Title: \")\n
          :PROPERTIES: Pages: %(number-to-string (read-number \"Pages:\")):END:\n
          Author: %(read-string \"Author: \")\n")

        ("w" "Web site" entry
         (file "")
         "* %a :website:\n\n%U %?\n\n%:initial")

        ("c" "Contact" entry (file+headline "~/.personal/org/contacts.org" "Friends")
         "* %(read-string \"Name: \")\n
          :PROPERTIES:\n
          :EMAIL: %(read-string \"emacs: \")\n
          :END:")

        ("Q" "quote org capture" entry
         (file+headline ,"~/.personal/org/inbox.org" "browsing")
         "* %?%:description Added %U
,#+BEGIN_QUOTE
%x
,#+END_QUOTE" :immediate-finish t)))
#+END_SRC

#+RESULTS: capture-templates
| t | Todo | entry | (file+headline ~/.personal/org/todo.org tasks) | * TODO %? |

* inprog coding/ide
** inprog completion
:PROPERTIES:
:header-args: :tangle yes
:END:
:samples:
https://gist.github.com/rswgnu/85ca5c69bb26551f3f27500855893dbe
:end:
*** company
#+BEGIN_SRC elisp
(use-package company
  :init
  (setq company-tooltip-align-annotations t)
  :defer 2
  :diminish
  :custom
  (company-begin-commands '(self-insert-command))
  (company-idle-delay .2)
  (company-minimum-prefix-length 2)
  (company-show-numbers t)
  (company-tooltip-align-annotations 't)
  (global-company-mode t))
(define-key global-map (kbd "C-.") 'company-files)
#+END_SRC

#+RESULTS:
: company-files

*** preview ala vim                                      :tocheck:notangle:
:PROPERTIES:
:header-args: :tangle no
:END:
#+BEGIN_SRC elisp
(defun company-preview-if-not-tng-frontend (command)
  "`company-preview-frontend', but not when tng is active."
  (unless (and (eq command 'post-command)
               company-selection-changed
               (memq 'company-tng-frontend company-frontends))
    (company-preview-frontend command)))
#+END_SRC
*** company-box :notangle:tocheck:
:PROPERTIES:
:header-args: :tangle no
:END:
#+BEGIN_SRC elisp
(use-package company-box
  :after company
  :diminish
  :hook (company-mode . company-box-mode))
#+END_SRC

*** other configs

** inprog snippets
:PROPERTIES:
:header-args: :tangle yes
:END:
*** inprog basic yas config
example:
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/macs/packages/")
(require 'yasnippet)
(use-package yasnippet-snippets)
(use-package helm-c-yasnippet)
(setq helm-yas-space-match-any-greedy t)
(global-set-key (kbd "C-c y") 'helm-yas-complete)
(setq yas-snippet-dirs
      '("~/macs/snippets"))
(yas-global-mode 1)
#+END_SRC

#+RESULTS:
: t

*** inprog yankpad                                               :notangle:
:PROPERTIES:
:header-args: :tangle no
:END:
#+begin_src elisp
(use-package yankpad
  :defer 10
  :init
  (setq yankpad-file "~/.personal/org/yankpad.org")
  :config
  (bind-key "<f7>" 'yankpad-map)
  (bind-key "<f12>" 'yankpad-expand)
  ;; If you want to complete snippets using company-mode
  (add-to-list 'company-backends #'company-yankpad)
  ;; If you want to expand snippets with hippie-expand
  (add-to-list 'hippie-expand-try-functions-list #'yankpad-expand))
#+end_src

** stable languages
*** inprog onliner setups
:PROPERTIES:
:header-args: :tangle yes
:END:
#+begin_src elisp
(setq slime-contribs '(slime-fancy slime-asdf))
(setq inferior-lisp-program "sbcl --dynamic-space-size 10000")
(setq inferior-julia-program-name "/usr/bin/julia")
(setq python-python-command "/usr/bin/ipython")

(use-package js2-mode)
(add-to-list 'auto-mode-alist '("\\.js\\'" . js2-mode))
(add-hook 'js2-mode-hook #'js2-imenu-extras-mode)

(add-to-list 'load-path "/home/gaston/.opam/4.07.1/share/emacs/site-lisp")
(require 'ocp-indent)


;; (setq erlang-root-dir "/usr/lib/erlang")
;; (add-to-list 'load-path "/usr/lib/erlang/lib/tools-3.2.1/emacs")
;; (add-to-list 'load-path "~/dotfiles/emacsy/packages/stable-packages/ob-erlang")
;; (add-to-list 'exec-path "/usr/lib/erlang/bin")
;; (require 'erlang-start)
;; (require 'ob-erlang)
#+end_src

#+RESULTS:
: ocp-indent

*** inprog ggtags
:PROPERTIES:
:header-args: :tangle yes
:END:
#+begin_src elisp
(require 'ggtags)
(add-hook 'c-mode-common-hook
          (lambda ()
            (when (derived-mode-p 'c-mode 'c++-mode 'java-mode 'asm-mode)
              (ggtags-mode 1))))

(define-key ggtags-mode-map (kbd "C-c g s") 'ggtags-find-other-symbol)
(define-key ggtags-mode-map (kbd "C-c g h") 'ggtags-view-tag-history)
(define-key ggtags-mode-map (kbd "C-c g r") 'ggtags-find-reference)
(define-key ggtags-mode-map (kbd "C-c g f") 'ggtags-find-file)
(define-key ggtags-mode-map (kbd "C-c g c") 'ggtags-create-tags)
(define-key ggtags-mode-map (kbd "C-c g u") 'ggtags-update-tags)

(define-key ggtags-mode-map (kbd "M-,") 'pop-tag-mark)
#+end_src
*** inprog haskell
:PROPERTIES:
:header-args: :tangle no
:END:
#+begin_src elisp
(require 'lsp)
(require 'lsp-haskell)
(require 'lsp-ui)
(add-hook 'haskell-mode-hook #'lsp)
(add-hook 'lsp-mode-hook 'lsp-ui-mode)
#+end_src

#+RESULTS:
| lsp-ui-mode |

*** stable babel
:PROPERTIES:
:header-args: :tangle yes
:END:
**** babel setup
#+BEGIN_SRC emacs-lisp
(require 'ob-shell)
(require 'ox-md)
(require 'julia-repl)
(add-hook 'julia-mode-hook 'julia-repl-mode)
(with-eval-after-load "ob"
  (require 'org-babel-eval-in-repl))
(require 'eval-in-repl)
  #+END_SRC

**** sly in org                                                 :notangle:
:PROPERTIES:
:header-args: :tangle no
:END:
#+begin_src elisp
(defcustom org-babel-lisp-eval-fn
  '("slime-eval" "sly-eval")
  "The function to be called to evaluate code on the lisp side."
  :group 'org-babel
  :version "24.1"
  :type 'listp)

(defun org-babel-execute:lisp (body params)
  "Execute a block of Common Lisp code with Babel."
  (pcase org-babel-lisp-eval-fn
    ("slime-eval" (require 'slime))
    ("sly-eval" (require 'sly)))
  (org-babel-reassemble-table
   (let ((result
          (funcall (if (member "output" (cdr (assoc :result-params params)))
                       #'car #'cadr)
                   (with-temp-buffer
                     (insert (org-babel-expand-body:lisp body params))
                     (funcall org-babel-lisp-eval-fn
                              `(swank:eval-and-grab-output
                                ,(let ((dir (if (assoc :dir params)
                                                (cdr (assoc :dir params))
                                              default-directory)))
                                   (format
                                    (if dir (format org-babel-lisp-dir-fmt dir)
                                      "(progn %s\n)")
                                    (buffer-substring-no-properties
                                     (point-min) (point-max)))))
                              (cdr (assoc :package params)))))))
     (org-babel-result-cond (cdr (assoc :result-params params))
       result
       (condition-case nil
           (read (org-babel-lisp-vector-to-list result))
         (error result))))
   (org-babel-pick-name (cdr (assoc :colname-names params))
                        (cdr (assoc :colnames params)))
   (org-babel-pick-name (cdr (assoc :rowname-names params))
                        (cdr (assoc :rownames params)))))
#+end_src

#+RESULTS:
: org-babel-execute:lisp

*** inprog ocaml
#+begin_src elisp
(add-hook 'tuareg-mode-hook #'(lambda() (setq mode-name "🐫")))
(let ((opam-share (ignore-errors (car (process-lines "opam" "config" "var" "share")))))
  (when (and opam-share (file-directory-p opam-share))
    ;; Register Merlin
    (add-to-list 'load-path (expand-file-name "emacs/site-lisp" opam-share))
    (autoload 'merlin-mode "merlin" nil t nil)
    ;; Automatically start it in OCaml buffers
    (add-hook 'tuareg-mode-hook 'merlin-mode t)
    ;; Use opam switch to lookup ocamlmerlin binary
    (setq merlin-command 'opam)))

#+end_src

#+RESULTS:
: opam
* inprog email
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "/usr/local/share/emacs/site-lisp/mu/mu4e")
#+END_SRC

#+RESULTS:
| /usr/local/share/emacs/site-lisp/mu/mu4e | /home/gaston/.emacs.d/.local/elpa/mu4e-overview-20191020.842 | /home/gaston/.doom.d/snippets/ | /home/gaston/.opam/4.07.1/share/emacs/site-lisp | /home/gaston/.emacs.d/.local/straight/build/ace-link | /home/gaston/.emacs.d/.local/straight/build/visual-fill-column | /home/gaston/.emacs.d/.local/straight/build/wordnut | /home/gaston/.emacs.d/.local/straight/build/langtool | /home/gaston/.emacs.d/.local/straight/build/mixed-pitch | /home/gaston/.emacs.d/.local/straight/build/synosaurus | /home/gaston/.emacs.d/.local/straight/build/twittering-mode | /home/gaston/.emacs.d/.local/straight/build/elfeed-org | /home/gaston/.emacs.d/.local/straight/build/elfeed | /home/gaston/.emacs.d/.local/straight/build/deferred | /home/gaston/.emacs.d/.local/straight/build/request-deferred | /home/gaston/.emacs.d/.local/straight/build/request | /home/gaston/.emacs.d/.local/straight/build/org-gcal | /home/gaston/.emacs.d/.local/straight/build/calfw-org | /home/gaston/.emacs.d/.local/straight/build/calfw | /home/gaston/.emacs.d/.local/straight/build/helm-notmuch | /home/gaston/.emacs.d/.local/straight/build/counsel-notmuch | /home/gaston/.emacs.d/.local/straight/build/org-mime | /home/gaston/.emacs.d/.local/straight/build/notmuch | /home/gaston/.emacs.d/.local/straight/build/flycheck-swift | /home/gaston/.emacs.d/.local/straight/build/swift-mode | /home/gaston/.emacs.d/.local/straight/build/geiser | /home/gaston/.emacs.d/.local/straight/build/qt-pro-mode | /home/gaston/.emacs.d/.local/straight/build/qml-mode | /home/gaston/.emacs.d/.local/straight/build/pyimpsort | /home/gaston/.emacs.d/.local/straight/build/shut-up | /home/gaston/.emacs.d/.local/straight/build/pyimport | /home/gaston/.emacs.d/.local/straight/build/python-pytest | /home/gaston/.emacs.d/.local/straight/build/nose | /home/gaston/.emacs.d/.local/straight/build/pipenv | /home/gaston/.emacs.d/.local/straight/build/pythonic | /home/gaston/.emacs.d/.local/straight/build/anaconda-mode | /home/gaston/.emacs.d/.local/straight/build/pip-requirements | /home/gaston/.emacs.d/.local/straight/build/flycheck-plantuml | /home/gaston/.emacs.d/.local/straight/build/plantuml-mode | /home/gaston/.emacs.d/.local/straight/build/ox-pandoc | /home/gaston/.emacs.d/.local/straight/build/ob-racket | /home/gaston/.emacs.d/.local/straight/build/ob-go | /home/gaston/.emacs.d/.local/straight/build/ob-async | /home/gaston/.emacs.d/.local/straight/build/org-re-reveal | /home/gaston/.emacs.d/.local/straight/build/org-tree-slide | /home/gaston/.emacs.d/.local/straight/build/centered-window | /home/gaston/.emacs.d/.local/straight/build/org-pomodoro | /home/gaston/.emacs.d/.local/straight/build/ob-ipython | /home/gaston/.emacs.d/.local/straight/build/orgit | /home/gaston/.emacs.d/.local/straight/build/org-pdfview | /home/gaston/.emacs.d/.local/straight/build/ox-clip | /home/gaston/.emacs.d/.local/straight/build/org-yt | /home/gaston/.emacs.d/.local/straight/build/org-fancy-priorities | /home/gaston/.emacs.d/.local/straight/build/org-plus-contrib | /home/gaston/.emacs.d/.local/straight/build/dune | /home/gaston/.emacs.d/.local/straight/build/ocamlformat | /home/gaston/.emacs.d/.local/straight/build/utop | /home/gaston/.emacs.d/.local/straight/build/ocp-indent | /home/gaston/.emacs.d/.local/straight/build/flycheck-ocaml | /home/gaston/.emacs.d/.local/straight/build/merlin-eldoc | /home/gaston/.emacs.d/.local/straight/build/merlin | /home/gaston/.emacs.d/.local/straight/build/caml | /home/gaston/.emacs.d/.local/straight/build/tuareg | /home/gaston/.emacs.d/.local/straight/build/evil-markdown | /home/gaston/.emacs.d/.local/straight/build/edit-indirect | /home/gaston/.emacs.d/.local/straight/build/markdown-toc | /home/gaston/.emacs.d/.local/straight/build/ivy-bibtex | /home/gaston/.emacs.d/.local/straight/build/latex-preview-pane | /home/gaston/.emacs.d/.local/straight/build/adaptive-wrap | /home/gaston/.emacs.d/.local/straight/build/auctex/ | /home/gaston/.emacs.d/.local/straight/build/auctex | /home/gaston/.emacs.d/.local/straight/build/xref-js2 | /home/gaston/.emacs.d/.local/straight/build/tide | /home/gaston/.emacs.d/.local/straight/build/simple-httpd | /home/gaston/.emacs.d/.local/straight/build/skewer-mode | /home/gaston/.emacs.d/.local/straight/build/nodejs-repl | /home/gaston/.emacs.d/.local/straight/build/npm-mode | /home/gaston/.emacs.d/.local/straight/build/multiple-cursors | /home/gaston/.emacs.d/.local/straight/build/js2-refactor | /home/gaston/.emacs.d/.local/straight/build/eslintd-fix | /home/gaston/.emacs.d/.local/straight/build/typescript-mode | /home/gaston/.emacs.d/.local/straight/build/rjsx-mode | /home/gaston/.emacs.d/.local/straight/build/js2-mode | /home/gaston/.emacs.d/.local/straight/build/coffee-mode | /home/gaston/.emacs.d/.local/straight/build/meghanada | /home/gaston/.emacs.d/.local/straight/build/groovy-mode | /home/gaston/.emacs.d/.local/straight/build/android-mode | /home/gaston/.emacs.d/.local/straight/build/prop-menu | /home/gaston/.emacs.d/.local/straight/build/idris-mode | /home/gaston/.emacs.d/.local/straight/build/hy-mode | /home/gaston/.emacs.d/.local/straight/build/intero | /home/gaston/.emacs.d/.local/straight/build/flycheck-golangci-lint | /home/gaston/.emacs.d/.local/straight/build/go-gen-test | /home/gaston/.emacs.d/.local/straight/build/go-tag | /home/gaston/.emacs.d/.local/straight/build/gorepl-mode | /home/gaston/.emacs.d/.local/straight/build/go-guru | /home/gaston/.emacs.d/.local/straight/build/go-mode | /home/gaston/.emacs.d/.local/straight/build/go-eldoc | /home/gaston/.emacs.d/.local/straight/build/pos-tip | /home/gaston/.emacs.d/.local/straight/build/company-quickhelp | /home/gaston/.emacs.d/.local/straight/build/fsharp-mode | /home/gaston/.emacs.d/.local/straight/build/ctable | /home/gaston/.emacs.d/.local/straight/build/ess-R-data-view | /home/gaston/.emacs.d/.local/straight/build/buttercup | /home/gaston/.emacs.d/.local/straight/build/flycheck-cask | /home/gaston/.emacs.d/.local/straight/build/elisp-demos | /home/gaston/.emacs.d/.local/straight/build/elisp-def | /home/gaston/.emacs.d/.local/straight/build/overseer | /home/gaston/.emacs.d/.local/straight/build/highlight-quoted | /home/gaston/.emacs.d/.local/straight/build/flycheck-elm | /home/gaston/.emacs.d/.local/straight/build/elm-mode | /home/gaston/.emacs.d/.local/straight/build/protobuf-mode | /home/gaston/.emacs.d/.local/straight/build/reformatter | /home/gaston/.emacs.d/.local/straight/build/dhall-mode | /home/gaston/.emacs.d/.local/straight/build/csv-mode | /home/gaston/.emacs.d/.local/straight/build/yaml-mode | /home/gaston/.emacs.d/.local/straight/build/jsonnet-mode | /home/gaston/.emacs.d/.local/straight/build/json-snatcher | /home/gaston/.emacs.d/.local/straight/build/json-reformat | /home/gaston/.emacs.d/.local/straight/build/json-mode | /home/gaston/.emacs.d/.local/straight/build/graphql-mode | /home/gaston/.emacs.d/.local/straight/build/math-symbol-lists | /home/gaston/.emacs.d/.local/straight/build/company-math | /home/gaston/.emacs.d/.local/straight/build/company-coq | /home/gaston/.emacs.d/.local/straight/build/proof-general/lib/ | /home/gaston/.emacs.d/.local/straight/build/proof-general/generic/ | /home/gaston/.emacs.d/.local/straight/build/proof-general | /home/gaston/.emacs.d/.local/straight/build/sly-repl-ansi-color | /home/gaston/.emacs.d/.local/straight/build/macrostep | /home/gaston/.emacs.d/.local/straight/build/sly-macrostep | /home/gaston/.emacs.d/.local/straight/build/helm-rtags | /home/gaston/.emacs.d/.local/straight/build/ivy-rtags | /home/gaston/.emacs.d/.local/straight/build/rtags | /home/gaston/.emacs.d/.local/straight/build/flycheck-irony | /home/gaston/.emacs.d/.local/straight/build/glsl-mode | /home/gaston/.emacs.d/.local/straight/build/opencl-mode | /home/gaston/.emacs.d/.local/straight/build/modern-cpp-font-lock | /home/gaston/.emacs.d/.local/straight/build/disaster | /home/gaston/.emacs.d/.local/straight/build/demangle-mode | /home/gaston/.emacs.d/.local/straight/build/cuda-mode | /home/gaston/.emacs.d/.local/straight/build/cmake-mode | /home/gaston/.emacs.d/.local/straight/build/nasm-mode | /home/gaston/.emacs.d/.local/straight/build/haxor-mode | /home/gaston/.emacs.d/.local/straight/build/mips-mode | /home/gaston/.emacs.d/.local/straight/build/agda2-mode | /home/gaston/.emacs.d/.local/straight/build/agda-input | /home/gaston/.emacs.d/.local/straight/build/kurecolor | /home/gaston/.emacs.d/.local/straight/build/rainbow-mode | /home/gaston/.emacs.d/.local/straight/build/makefile-executor | /home/gaston/.emacs.d/.local/straight/build/evil-magit | /home/gaston/.emacs.d/.local/straight/build/hl-todo | /home/gaston/.emacs.d/.local/straight/build/magit-todos | /home/gaston/.emacs.d/.local/straight/build/magit-popup | /home/gaston/.emacs.d/.local/straight/build/magit-gitflow | /home/gaston/.emacs.d/.local/straight/build/treepy | /home/gaston/.emacs.d/.local/straight/build/ghub | /home/gaston/.emacs.d/.local/straight/build/emacsql | /home/gaston/.emacs.d/.local/straight/build/emacsql-sqlite | /home/gaston/.emacs.d/.local/straight/build/closql | /home/gaston/.emacs.d/.local/straight/build/forge | /home/gaston/.emacs.d/.local/straight/build/with-editor | /home/gaston/.emacs.d/.local/straight/build/git-commit | /home/gaston/.emacs.d/.local/straight/build/magit | /home/gaston/.emacs.d/.local/straight/build/counsel-dash | /home/gaston/.emacs.d/.local/straight/build/helm-dash | /home/gaston/.emacs.d/.local/straight/build/dash-docs | /home/gaston/.emacs.d/.local/straight/build/helm-xref | /home/gaston/.emacs.d/.local/straight/build/ivy-xref | /home/gaston/.emacs.d/.local/straight/build/dumb-jump | /home/gaston/.emacs.d/.local/straight/build/marshal | /home/gaston/.emacs.d/.local/straight/build/logito | /home/gaston/.emacs.d/.local/straight/build/pcache | /home/gaston/.emacs.d/.local/straight/build/gh | /home/gaston/.emacs.d/.local/straight/build/gist | /home/gaston/.emacs.d/.local/straight/build/vterm | /home/gaston/.emacs.d/.local/straight/build/multi-term | /home/gaston/.emacs.d/.local/straight/build/esh-help | /home/gaston/.emacs.d/.local/straight/build/eshell-z | /home/gaston/.emacs.d/.local/straight/build/eshell-up | /home/gaston/.emacs.d/.local/straight/build/fd-dired | /home/gaston/.emacs.d/.local/straight/build/dired-rsync | /home/gaston/.emacs.d/.local/straight/build/diff-hl | /home/gaston/.emacs.d/.local/straight/build/dired-git-info | /home/gaston/.emacs.d/.local/straight/build/diredfl | /home/gaston/.emacs.d/.local/straight/build/rotate-text | /home/gaston/.emacs.d/.local/straight/build/evil-mc | /home/gaston/.emacs.d/.local/straight/build/iedit | /home/gaston/.emacs.d/.local/straight/build/evil-multiedit | /home/gaston/.emacs.d/.local/straight/build/format-all | /home/gaston/.emacs.d/.local/straight/build/vimish-fold | /home/gaston/.emacs.d/.local/straight/build/evil-vimish-fold | /home/gaston/.emacs.d/.local/straight/build/ivy-rich | /home/gaston/.emacs.d/.local/straight/build/ivy-hydra | /home/gaston/.emacs.d/.local/straight/build/counsel-projectile | /home/gaston/.emacs.d/.local/straight/build/counsel | /home/gaston/.emacs.d/.local/straight/build/amx | /home/gaston/.emacs.d/.local/straight/build/helm-org | /home/gaston/.emacs.d/.local/straight/build/swiper | /home/gaston/.emacs.d/.local/straight/build/swiper-helm | /home/gaston/.emacs.d/.local/straight/build/helm-projectile | /home/gaston/.emacs.d/.local/straight/build/helm-describe-modes | /home/gaston/.emacs.d/.local/straight/build/helm-company | /home/gaston/.emacs.d/.local/straight/build/persp-mode | /home/gaston/.emacs.d/.local/straight/build/gitignore-mode | /home/gaston/.emacs.d/.local/straight/build/gitconfig-mode | /home/gaston/.emacs.d/.local/straight/build/git-timemachine | /home/gaston/.emacs.d/.local/straight/build/git-link | /home/gaston/.emacs.d/.local/straight/build/fringe-helper | /home/gaston/.emacs.d/.local/straight/build/git-gutter | /home/gaston/.emacs.d/.local/straight/build/git-gutter-fringe | /home/gaston/.emacs.d/.local/straight/build/flycheck-popup-tip | /home/gaston/.emacs.d/.local/straight/build/flycheck | /home/gaston/.emacs.d/.local/straight/build/flyspell-correct-ivy | /home/gaston/.emacs.d/.local/straight/build/flyspell-correct | /home/gaston/.emacs.d/.local/straight/build/doom-snippets | /home/gaston/.emacs.d/.local/straight/build/auto-yasnippet | /home/gaston/.emacs.d/.local/straight/build/evil-quick-diff | /home/gaston/.emacs.d/.local/straight/build/exato | /home/gaston/.emacs.d/.local/straight/build/evil-visualstar | /home/gaston/.emacs.d/.local/straight/build/evil-traces | /home/gaston/.emacs.d/.local/straight/build/evil-textobj-anyblock | /home/gaston/.emacs.d/.local/straight/build/evil-snipe | /home/gaston/.emacs.d/.local/straight/build/evil-numbers | /home/gaston/.emacs.d/.local/straight/build/evil-nerd-commenter | /home/gaston/.emacs.d/.local/straight/build/evil-indent-plus | /home/gaston/.emacs.d/.local/straight/build/evil-exchange | /home/gaston/.emacs.d/.local/straight/build/evil-escape | /home/gaston/.emacs.d/.local/straight/build/evil-surround | /home/gaston/.emacs.d/.local/straight/build/expand-region | /home/gaston/.emacs.d/.local/straight/build/embrace | /home/gaston/.emacs.d/.local/straight/build/evil-embrace | /home/gaston/.emacs.d/.local/straight/build/evil-easymotion | /home/gaston/.emacs.d/.local/straight/build/evil-args | /home/gaston/.emacs.d/.local/straight/build/quickrun | /home/gaston/.emacs.d/.local/straight/build/helm-c-yasnippet | /home/gaston/.emacs.d/.local/straight/build/helm-org-rifle | /home/gaston/.emacs.d/.local/straight/build/pyvenv | /home/gaston/.emacs.d/.local/straight/build/highlight-indentation | /home/gaston/.emacs.d/.local/straight/build/elpy | /home/gaston/.emacs.d/.local/straight/build/company | /home/gaston/.emacs.d/.local/straight/build/ripgrep | /home/gaston/.emacs.d/.local/straight/build/projectile-ripgrep | /home/gaston/.emacs.d/.local/straight/build/helm-rg | /home/gaston/.emacs.d/.local/straight/build/wgrep | /home/gaston/.emacs.d/.local/straight/build/transient | /home/gaston/.emacs.d/.local/straight/build/rg | /home/gaston/.emacs.d/.local/straight/build/yasnippet-snippets | /home/gaston/.emacs.d/.local/straight/build/yasnippet | /home/gaston/.emacs.d/.local/straight/build/engine-mode | /home/gaston/.emacs.d/.local/straight/build/names | /home/gaston/.emacs.d/.local/straight/build/org-fs-tree | /home/gaston/.emacs.d/.local/straight/build/org-writers-room | /home/gaston/.emacs.d/.local/straight/build/ob-rust | /home/gaston/.emacs.d/.local/straight/build/zotxt-emacs | /home/gaston/.emacs.d/.local/straight/build/pdf-tools | /home/gaston/.emacs.d/.local/straight/build/key-chord | /home/gaston/.emacs.d/.local/straight/build/hydra | /home/gaston/.emacs.d/.local/straight/build/ivy | /home/gaston/.emacs.d/.local/straight/build/htmlize | /home/gaston/.emacs.d/.local/straight/build/org-ref | /home/gaston/.emacs.d/.local/straight/build/org-wiki | /home/gaston/.emacs.d/.local/straight/build/org-board | /home/gaston/.emacs.d/.local/straight/build/enlive | /home/gaston/.emacs.d/.local/straight/build/org-books | /home/gaston/.emacs.d/.local/straight/build/org-protocol-capture-html | /home/gaston/.emacs.d/.local/straight/build/font-lock+ | /home/gaston/.emacs.d/.local/straight/build/tao-theme | /home/gaston/.emacs.d/.local/straight/build/doom-themes | /home/gaston/.emacs.d/.local/straight/build/org-download | /home/gaston/.emacs.d/.local/straight/build/tablist | /home/gaston/.emacs.d/.local/straight/build/navigel | /home/gaston/.emacs.d/.local/straight/build/libmpdel | /home/gaston/.emacs.d/.local/straight/build/mpdel | /home/gaston/.emacs.d/.local/straight/build/drag-stuff | /home/gaston/.emacs.d/.local/straight/build/yankpad | /home/gaston/.emacs.d/.local/straight/build/sly | /home/gaston/.emacs.d/.local/straight/build/ess/obsolete/ | /home/gaston/.emacs.d/.local/straight/build/ess/ | /home/gaston/.emacs.d/.local/straight/build/julia-mode | /home/gaston/.emacs.d/.local/straight/build/ess | /home/gaston/.emacs.d/.local/straight/build/matlab-mode | /home/gaston/.emacs.d/.local/straight/build/avy | /home/gaston/.emacs.d/.local/straight/build/ace-window | /home/gaston/.emacs.d/.local/straight/build/paredit | /home/gaston/.emacs.d/.local/straight/build/eval-in-repl | /home/gaston/.emacs.d/.local/straight/build/org-babel-eval-in-repl | /home/gaston/.emacs.d/.local/straight/build/let-alist | /home/gaston/.emacs.d/.local/straight/build/biblio-core | /home/gaston/.emacs.d/.local/straight/build/biblio | /home/gaston/.emacs.d/.local/straight/build/parsebib | /home/gaston/.emacs.d/.local/straight/build/helm-bibtex | /home/gaston/.emacs.d/.local/straight/build/org-cliplink | /home/gaston/.emacs.d/.local/straight/build/org-brain | /home/gaston/.emacs.d/.local/straight/build/ts | /home/gaston/.emacs.d/.local/straight/build/org-super-agenda | /home/gaston/.emacs.d/.local/straight/build/org-bullets | /home/gaston/.emacs.d/.local/straight/build/org | /home/gaston/.emacs.d/.local/straight/build/org-noter | /home/gaston/.emacs.d/.local/straight/build/toc-org | /home/gaston/.emacs.d/.local/straight/build/evil-org | /home/gaston/.emacs.d/.local/straight/build/gnus-desktop-notify | /home/gaston/.emacs.d/.local/straight/build/poet-theme | /home/gaston/.emacs.d/.local/straight/build/lsp-ui | /home/gaston/.emacs.d/.local/straight/build/haskell-mode | /home/gaston/.emacs.d/.local/straight/build/lv | /home/gaston/.emacs.d/.local/straight/build/markdown-mode | /home/gaston/.emacs.d/.local/straight/build/spinner | /home/gaston/.emacs.d/.local/straight/build/ht | /home/gaston/.emacs.d/.local/straight/build/lsp-mode | /home/gaston/.emacs.d/.local/straight/build/lsp-haskell | /home/gaston/.emacs.d/.local/straight/build/helm-core | /home/gaston/.emacs.d/.local/straight/build/popup | /home/gaston/.emacs.d/.local/straight/build/helm | /home/gaston/.emacs.d/.local/straight/build/helm-gtags | /home/gaston/.emacs.d/.local/straight/build/ggtags | /home/gaston/.emacs.d/.local/straight/build/irony-eldoc | /home/gaston/.emacs.d/.local/straight/build/irony | /home/gaston/.emacs.d/.local/straight/build/julia-repl | /home/gaston/.emacs.d/.local/straight/build/annalist | /home/gaston/.emacs.d/.local/straight/build/goto-chg | /home/gaston/.emacs.d/.local/straight/build/evil | /home/gaston/.emacs.d/.local/straight/build/evil-collection | /home/gaston/.emacs.d/.local/straight/build/fountain-mode | /home/gaston/.emacs.d/.local/straight/build/log4e | /home/gaston/.emacs.d/.local/straight/build/gntp | /home/gaston/.emacs.d/.local/straight/build/alert | /home/gaston/.emacs.d/.local/straight/build/org-wild-notifier | /home/gaston/.emacs.d/.local/straight/build/faceup | /home/gaston/.emacs.d/.local/straight/build/racket-mode | /home/gaston/.emacs.d/.local/straight/build/autothemer | /home/gaston/.emacs.d/.local/straight/build/kaolin-themes | /home/gaston/.emacs.d/.local/straight/build/ranger | /home/gaston/.emacs.d/.local/straight/build/shrink-path | /home/gaston/.emacs.d/.local/straight/build/doom-modeline | /home/gaston/.emacs.d/.local/straight/build/which-key | /home/gaston/.emacs.d/.local/straight/build/general | /home/gaston/.emacs.d/.local/straight/build/epl | /home/gaston/.emacs.d/.local/straight/build/pkg-info | /home/gaston/.emacs.d/.local/straight/build/projectile | /home/gaston/.emacs.d/.local/straight/build/xclip | /home/gaston/.emacs.d/.local/straight/build/ws-butler | /home/gaston/.emacs.d/.local/straight/build/undo-tree | /home/gaston/.emacs.d/.local/straight/build/so-long | /home/gaston/.emacs.d/.local/straight/build/smartparens | /home/gaston/.emacs.d/.local/straight/build/pcre2el | /home/gaston/.emacs.d/.local/straight/build/loop | /home/gaston/.emacs.d/.local/straight/build/elisp-refs | /home/gaston/.emacs.d/.local/straight/build/f | /home/gaston/.emacs.d/.local/straight/build/s | /home/gaston/.emacs.d/.local/straight/build/dash-functional | /home/gaston/.emacs.d/.local/straight/build/dash | /home/gaston/.emacs.d/.local/straight/build/helpful | /home/gaston/.emacs.d/.local/straight/build/dtrt-indent | /home/gaston/.emacs.d/.local/straight/build/better-jumper | /home/gaston/.emacs.d/.local/straight/build/restart-emacs | /home/gaston/.emacs.d/.local/straight/build/rainbow-delimiters | /home/gaston/.emacs.d/.local/straight/build/parent-mode | /home/gaston/.emacs.d/.local/straight/build/highlight-numbers | /home/gaston/.emacs.d/.local/straight/build/hide-mode-line | /home/gaston/.emacs.d/.local/straight/build/memoize | /home/gaston/.emacs.d/.local/straight/build/all-the-icons | /home/gaston/.emacs.d/.local/straight/build/auto-minor-mode | /home/gaston/.emacs.d/.local/straight/build/dotenv-mode | /home/gaston/.emacs.d/.local/straight/build/gcmh | /home/gaston/.emacs.d/.local/straight/build/async | /home/gaston/.emacs.d/.local/straight/build/bind-key | /home/gaston/.emacs.d/.local/straight/build/use-package | /home/gaston/.emacs.d/.local/straight/build/straight | /home/gaston/.emacs.d/.local/elpa/abyss-theme-20170808.1345 | /home/gaston/.emacs.d/.local/elpa/company-box-20190311.1745 | /home/gaston/.emacs.d/.local/elpa/company-coq-20191025.2219 | /home/gaston/.emacs.d/.local/elpa/company-math-20190507.2006 | /home/gaston/.emacs.d/.local/elpa/company-20191127.16 | /home/gaston/.emacs.d/.local/elpa/dash-functional-20191109.1327 | /home/gaston/.emacs.d/.local/elpa/doom-modeline-20191202.1710 | /home/gaston/.emacs.d/.local/elpa/all-the-icons-20191127.1123 | /home/gaston/.emacs.d/.local/elpa/flymake-racket-20180912.109 | /home/gaston/.emacs.d/.local/elpa/flymake-shellcheck-20181214.24 | /home/gaston/.emacs.d/.local/elpa/insert-kaomoji-20190701.1823 | /home/gaston/.emacs.d/.local/elpa/kaomoji-20171227.440 | /home/gaston/.emacs.d/.local/elpa/helm-core-20191208.747 | /home/gaston/.emacs.d/.local/elpa/async-20191030.2138 | /home/gaston/.emacs.d/.local/elpa/math-symbol-lists-20190605.2058 | /home/gaston/.emacs.d/.local/elpa/memoize-20191126.2002 | /home/gaston/.emacs.d/.local/elpa/mood-line-20191101.1955 | /home/gaston/.emacs.d/.local/elpa/mutt-mode-20191102.2330 | /home/gaston/.emacs.d/.local/elpa/notmuch-20191203.1143 | /home/gaston/.emacs.d/.local/elpa/ox-hugo-20191204.1552 | /home/gaston/.emacs.d/.local/elpa/racket-mode-20191204.205 | /home/gaston/.emacs.d/.local/elpa/faceup-20170925.1946 | /home/gaston/.emacs.d/.local/elpa/shrink-path-20190208.1335 | /home/gaston/.emacs.d/.local/elpa/vimrc-mode-20181116.1919 | /home/gaston/.emacs.d/.local/elpa/workgroups2-20141102.1922 | /home/gaston/.emacs.d/.local/elpa/f-20191110.1357 | /home/gaston/.emacs.d/.local/elpa/s-20180406.808 | /home/gaston/.emacs.d/.local/elpa/anaphora-20180618.2200 | /home/gaston/.emacs.d/.local/elpa/dash-20191109.1327 | /home/gaston/.emacs.d/.local/elpa/yasnippet-20191030.1331 | /home/gaston/.emacs.d/core/ | /home/gaston/.emacs.d/core | /usr/share/emacs/26.3/site-lisp | /usr/share/emacs/site-lisp | /usr/share/emacs/26.3/lisp | /usr/share/emacs/26.3/lisp/vc | /usr/share/emacs/26.3/lisp/url | /usr/share/emacs/26.3/lisp/textmodes | /usr/share/emacs/26.3/lisp/progmodes | /usr/share/emacs/26.3/lisp/play | /usr/share/emacs/26.3/lisp/nxml | /usr/share/emacs/26.3/lisp/net | /usr/share/emacs/26.3/lisp/mh-e | /usr/share/emacs/26.3/lisp/mail | /usr/share/emacs/26.3/lisp/leim | /usr/share/emacs/26.3/lisp/language | /usr/share/emacs/26.3/lisp/international | /usr/share/emacs/26.3/lisp/image | /usr/share/emacs/26.3/lisp/gnus | /usr/share/emacs/26.3/lisp/eshell | /usr/share/emacs/26.3/lisp/erc | /usr/share/emacs/26.3/lisp/emulation | /usr/share/emacs/26.3/lisp/emacs-lisp | /usr/share/emacs/26.3/lisp/cedet | /usr/share/emacs/26.3/lisp/calendar | /usr/share/emacs/26.3/lisp/calc | /usr/share/emacs/26.3/lisp/obsolete |

* installed package list and ref
** org-wiki
** ox-hugo
** org-wild-notifier
:PROPERTIES:
:url:      https://github.com/akhramov/org-wild-notifier.el
:END:
** org-download
** org-brain
** org-fs-tree                                                  :manualpack:
** org-protocol-capture-html                                    :manualpack:
** org-web-tools
** org-super-agenda
** org-cliplink
** org-books
** org-board
** org-ref

** ide
** general text

* misc
** live code
*** free keybindings
#+begin_src elisp
;;; free-keys.el --- Show free keybindings for modkeys or prefixes

;; Copyright (C) 2013 Matus Goljer

;; Author: Matus Goljer <matus.goljer@gmail.com>
;; Maintainer: Matus Goljer <matus.goljer@gmail.com>
;; Version: 0.1
;; Created: 3rd November 2013
;; Keywords: convenience
;; Package-Requires: ((cl-lib "0.3"))
;; URL: https://github.com/Fuco1/free-keys

;; This file is not part of GNU Emacs.

;; This program is free software; you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation, either version 3 of the License, or
;; (at your option) any later version.

;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.

;; You should have received a copy of the GNU General Public License
;; along with this program.  If not, see <http://www.gnu.org/licenses/>.

;;; Commentary:

;; Show free keybindings for modkeys or prefixes. Based on code
;; located here: https://gist.github.com/bjorne/3796607
;;
;; For complete description see https://github.com/Fuco1/free-keys

;;; Code:

(require 'cl-lib)

(defgroup free-keys ()
  "Free keys."
  :group 'convenience)

(defcustom free-keys-modifiers '("" "C" "M" "C-M")
  "List of modifiers that can be used in front of keys."
  :type '(repeat string)
  :group 'free-keys)

(defcustom free-keys-keys "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890!@#$%^&*()-=[]{};'\\:\"|,./<>?`~"
  "String or list of keys that can be used as bindings.
In case of string, each letter is interpreted as a character to
test.
In case of list, each item is considered as key code.  This
allows you to add keys such as TAB or RET."
  :type '(choice
          (string :tag "String of characters")
          (repeat :tag "List of characters" string))
  :group 'free-keys)

(defcustom free-keys-ignored-bindings nil
  "List of bindings with modifiers which should never be considered free.
The elements could be either strings of form \"MOD-KEY\" or cons
where the car is a single letter modifier as in
`free-keys-modifiers' and the cdr is a string containing keys to
be ignored with this modifiers, like `free-keys-keys'.
The bindings should not contain a prefix.  This can typically be
used to ignore bindings intercepted by the window manager used
for swapping windows and similar operations."
  :type '(repeat (choice (string :tag "Key binding")
                         (cons :tag "Modifier and string of key bindings"
                               (string :tag "Modifier")
                               (string :tag "Key bindings"))))
  :group 'free-keys)

(defun free-keys-ignored-bindings ()
  "Return a list of bindings that should never be considered free.
The elements of the returned list are of form \"MOD-KEY\".
See also the variable `free-keys-ignored-bindings'."
  (apply 'append
         (mapcar (lambda (x)
                   (if (stringp x) (list x)
                     (mapcar (lambda (y)
                               (concat (car x) "-" (char-to-string y)))
                             (cdr x))))
                 free-keys-ignored-bindings)))

(defvar free-keys-mode-map
  (let ((map (make-keymap)))
    (define-key map "b" 'free-keys-change-buffer)
    (define-key map "p" 'free-keys-set-prefix)
    map)
  "Keymap for Free Keys mode.")

(defvar free-keys-original-buffer nil
  "Buffer from which `free-keys' was called.")

(defun free-keys--print-in-columns (key-list &optional columns)
  "Print the KEY-LIST into as many columns as will fit into COLUMNS characters.
The columns are ordered according to variable `free-keys-keys',
advancing down-right.  The margin between each column is 5 characters."
  (setq columns (or columns 80))
  (let* ((len (+ 5 (length (car key-list))))
         (num-of-keys (length key-list))
         (cols (/ columns len))
         (rows (1+ (/ num-of-keys cols)))
         (rem (mod num-of-keys cols))
         (cur-col 0)
         (cur-row 0))
    (dotimes (i num-of-keys)
      (insert (nth
               (+ (* cur-col rows) cur-row (if (> cur-col rem) (- rem cur-col) 0))
               key-list)
              "     ")
      (cl-incf cur-col)
      (when (= cur-col cols)
        (insert "\n")
        (setq cur-col 0)
        (cl-incf cur-row)))))

(defun free-keys-set-prefix (prefix)
  "Change the prefix in current *Free keys* buffer to PREFIX and
update the display."
  (interactive "sPrefix: ")
  (free-keys prefix free-keys-original-buffer))

(defun free-keys-change-buffer (buffer)
  "Change the buffer for which the bindings are displayed to
BUFFER and update the display."
  (interactive "bShow free bindings for buffer: ")
  (free-keys nil (get-buffer-create buffer)))

(defun free-keys-revert-buffer (_ignore-auto _noconfirm)
  "Revert the *Free keys* buffer.
This simply calls `free-keys'."
  (free-keys nil free-keys-original-buffer))

(defun free-keys--process-modifier (prefix modifier)
  "Process free bindings for MODIFIER."
  (let (empty-keys)
    (mapc (lambda (key)
            (let* ((key-as-string (cond
                                   ((characterp key) (char-to-string key))
                                   ((stringp key) key)
                                   (t (error "Key is not a character nor a string"))))
                   (key-name
                    (if (not (equal modifier ""))
                        (concat modifier "-" key-as-string)
                      key-as-string))
                   (full-name
                    (if (and prefix (not (equal prefix ""))) (concat prefix " " key-name) key-name))
                   (binding
                    (with-current-buffer free-keys-original-buffer (key-binding (read-kbd-macro full-name)))))
              (when (and (not (member key-name (free-keys-ignored-bindings)))
                         (or (not binding)
                             (eq binding 'undefined)))
                (push full-name empty-keys))))
          free-keys-keys)
    (let ((len (length empty-keys)))
      (when (> len 0)
        (if (not (equal modifier ""))
            (insert (format "With modifier %s (%d free)\n=========================\n" modifier len))
          (insert (format "With no modifier (%d free)\n=========================\n" len)))
        (free-keys--print-in-columns (nreverse empty-keys))
        (insert "\n\n")))))

;;;###autoload
(defun free-keys (&optional prefix buffer)
  "Display free keys in current buffer.
A free key is a key that has no associated key-binding as
determined by function `key-binding'.
By default, keys on `free-keys-keys' list with no prefix sequence
are considered, possibly together with modifier keys from
`free-keys-modifiers'.  You can change the prefix sequence by
hitting 'p' in the *Free keys* buffer.  Prefix is supplied in
format recognized by `kbd', for example \"C-x\"."
  (interactive (list (when current-prefix-arg
                       (read-from-minibuffer "Prefix: "))))
  (setq prefix (or prefix ""))
  (setq free-keys-original-buffer (or buffer (current-buffer)))
  (let ((buf (get-buffer-create "*Free keys*")))
    (pop-to-buffer buf)
    (with-current-buffer buf
      (if (fboundp 'read-only-mode)
          (read-only-mode -1)
        (setq buffer-read-only nil))
      (erase-buffer)
      (insert "Free keys"
              (if (not (equal prefix "")) (format " with prefix %s" prefix) "")
              " in buffer "
              (buffer-name free-keys-original-buffer)
              " (major mode: " (with-current-buffer free-keys-original-buffer (symbol-name major-mode)) ")\n\n")
      (mapc (lambda (m) (free-keys--process-modifier prefix m)) free-keys-modifiers)
      (setq buffer-read-only t)
      (goto-char 0)
      (free-keys-mode))))

(define-derived-mode free-keys-mode special-mode "Free Keys"
  "Free keys mode.
Display the free keybindings in current buffer.
\\{free-keys-mode-map}"
  (set (make-local-variable 'revert-buffer-function) 'free-keys-revert-buffer)
  (set (make-local-variable 'header-line-format) "Help: (b) change buffer (p) change prefix (q) quit"))

(provide 'free-keys)
;;; free-keys.el ends here

#+end_src

#+RESULTS:
: free-keys


*** inbuffer settings

#+NAME: Lecture 2 Wildberger Algebraic topology
#+ATTR_ORG: :width 200/250/300/400/500/600


** configs
https://github.com/rememberYou/.emacs.d/blob/master/config.org
https://emacs.christianbaeuerlein.com/my-org-config.html
http://aaronbedra.com/emacs.d/#org-habit
https://github.com/fuxialexander/doom-emacs-private-xfu/blob/master/modules/lang/org-private/config.el
https://karl-voit.at/2014/12/03/emacs-chat/
https://joshrollinswrites.com/emacsorg/org-capture-template-1/
https://github.com/daviwil/dotfiles/blob/master/emacs/config/org-mode.el



** capture-templates
zqktlwi4i34kbat3.onion
